{"KE4001": {"acadYear": "2019/2020", "description": "KE4001-1 Introduction to Knowledge Engineering\nThis course introduces students to the KE programme. It gives a course overview, and course describes course rules and regulations; and student administration; It then gives  an introduction to KE:  and describes history and relevance, broad application areas; Knowledge representation: rules, frames & logic, basics of logical inference, and basics of search. This module is compulsory for all KE students.\n\nKE4001-2 Knowledge-Based Systems (KBS)\nThis module is intended to act as an introduction to KBS. Major topics in this course include Principles of rule-based reasoning; forward and backward chaining; Introduction to CLIPS or ECLIPSE or equivalent rule-based tools; Hybrid KBS. There is an in-course assignment using the ECLIPSE tool. This module is compulsory for all KE students.\n\nKE4001-3 Introduction to Advanced KE Technologies\nThe objectives of this module is to give an overview of umbrella KE technologies. Major topics in this course include neural nets, fuzzy logic, case-based reasoning, machine learning, genetic algorithms, constraint propagation, intelligent agents, and other relevant KE Technologies. This module is compulsory for all KE students.", "title": "Fundamentals of Knowledge Engineering", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [3, 1, 1, 9.2, 5], "moduleCredit": "4", "moduleCode": "KE4001", "semesterData": []}, "KE4002": {"acadYear": "2019/2020", "description": "The objective of this module is to teach the fundamentals of CBR and how to apply CBR to solve real world problems. Topics covered in this module include CBR concepts; CBR applications survey; CBR techniques: case representation, case indexing, case storage and retrieval; Case adaptation; Learning and generalization; Identifying applications; CBR Tools survey; and Hybrid systems. There is an assignment in which students will design and possibly implement a CBR system in their workplace. This course is appropriate for knowledge engineers who wish to apply CBR techniques for knowledge management.", "title": "Case Based Reasoning", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1.5, 0.5, 0.5, 3, 1.8], "moduleCredit": "4", "moduleCode": "KE4002", "semesterData": []}, "KE4003": {"acadYear": "2019/2020", "description": "The objective of this module is to teach students to understand and use fuzzy systems .The module begins by describing basic concepts of fuzzy systems, and the main fields of fuzzy logic research. It then goes on to introduce fuzzy set theory and fuzzy logic and shows important applications of fuzzy logic, such as fuzzy control systems, fuzzy expert systems, fuzzy optimization & fuzzy multi-attribute decision making models and fuzzy rule based pattern classification models. Finally the module describes the interaction of fuzzy systems with other KE technologies (e.g. Neural Networks, Genetic Algorithms.) This course is appropriate for knowledge engineers who wish to learn how to use Fuzzy logic systems.", "title": "Fuzzy Systems", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1.5, 0.5, 0.5, 3, 1.8], "moduleCredit": "4", "moduleCode": "KE4003", "semesterData": []}, "KE4004": {"acadYear": "2019/2020", "description": "The objectives of this course are to introduce students to the concepts, methods and techniques of business analytics. Students will gain the requisite skills to perform analytics in a real life business scenarios through workshops and assignments using tools. Topics included in the course are:\n• Introduction to Business Analytics (NEW);\n• Business Intelligence fundamentals (NEW);\n• Exploratory data analysis and visualization;\n• Segmentation and clustering;\n• Market basket analysis;\n• Advanced modelling using decision trees, rule induction, regression, neural networks;\n• Data mining for CRM and market planning;\n• Data mining tools.\nThis course is highly appropriate for all professional workers who must process and analyze large amounts of data for corporate decision making.", "title": "Business Analytics", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [2, 0.5, 0.5, 3, 2], "moduleCredit": "4", "moduleCode": "KE4004", "semesterData": []}, "KE4005": {"acadYear": "2019/2020", "description": "The objective of this module is to provide an introduction to knowledge management for software/knowledge engineers. It will cover the essential principles and best practices of knowledge management (KM) as they are applied within the software development industry. (refer to syllabus below for topics covered) There is an assignment in which students design and possibly implement a KM system in their workplace. This course is appropriate for software engineers who wish to gain an appreciation of KM and how it can be applied to Software Engineering projects.", "title": "Introduction to Knowledge Management", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [2, 0.5, 0.5, 3, 2], "moduleCredit": "4", "moduleCode": "KE4005", "semesterData": []}, "KE4101": {"acadYear": "2019/2020", "description": "KE4001-1 Introduction to Knowledge Engineering\nThis course introduces students to the KE programme. It gives a course overview, and course describes course rules and regulations; and student administration; It then gives  an introduction to KE:  and describes history and relevance, broad application areas; Knowledge representation: rules, frames & logic, basics of logical inference, and basics of search. This module is compulsory for all KE students.\n\nKE4001-2 Knowledge-Based Systems (KBS)\nThis module is intended to act as an introduction to KBS. Major topics in this course include Principles of rule-based reasoning; forward and backward chaining; Introduction to CLIPS or ECLIPSE or equivalent rule-based tools; Hybrid KBS. There is an in-course assignment using the ECLIPSE tool. This module is compulsory for all KE students.\n\nKE4001-3 Introduction to Advanced KE Technologies\nThe objectives of this module is to give an overview of umbrella KE technologies. Major topics in this course include neural nets, fuzzy logic, case-based reasoning, machine learning, genetic algorithms, constraint propagation, intelligent agents, and other relevant KE Technologies. This module is compulsory for all KE students.", "title": "Fundamentals of Knowledge Engineering", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [3, 1, 1, 9.2, 5], "moduleCredit": "8", "moduleCode": "KE4101", "semesterData": []}, "KE4102": {"acadYear": "2019/2020", "description": "The aim of this first core course - unit 1 of the Master of Technology (MTech) in Knowledge Engineering (KE) - is to provide a foundation for the KE degree. The focus of the degree is on educating the developers of intelligent systems to be used for Business Analytics. So the objectives of this foundation course are to: \n(1) Introduce the basic concepts and major techniques of Business Analytics. \n(2) Provide an overview of knowledge-based systems and an introduction to statistical and machine learning, with Business Analytics as the target application area.", "title": "Intelligent Systems and Techniques for Business Analytics", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [3, 1, 0.01, 10, 5], "moduleCredit": "8", "moduleCode": "KE4102", "semesterData": [], "fulfillRequirements": ["KE5109", "KE5108"]}, "KE4202": {"acadYear": "2019/2020", "description": "The objective of this module is to teach the fundamentals of CBR and how to apply CBR to solve real world problems. Topics covered in this module include CBR concepts; CBR applications survey; CBR techniques: case representation, case indexing, case storage and retrieval; Case adaptation; Learning and generalization; Identifying applications; CBR Tools survey; and Hybrid systems. There is an assignment in which students will design and possibly implement a CBR system in their workplace. This course is appropriate for knowledge engineers who wish to apply CBR techniques for knowledge management.", "title": "Case Based Reasoning", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1.5, 0.5, 0.5, 3, 1.8], "moduleCredit": "3", "moduleCode": "KE4202", "semesterData": []}, "KE4203": {"acadYear": "2019/2020", "description": "The objective of this module is to teach students to understand and use fuzzy systems .The module begins by describing basic concepts of fuzzy systems, and the main fields of fuzzy logic research. It then goes on to introduce fuzzy set theory and fuzzy logic and shows important applications of fuzzy logic, such as fuzzy control systems, fuzzy expert systems, fuzzy optimization & fuzzy multi-attribute decision making models and fuzzy rule based pattern classification models. Finally the module describes the interaction of fuzzy systems with other KE technologies (e.g. Neural Networks, Genetic Algorithms.) This course is appropriate for knowledge engineers who wish to learn how to use Fuzzy logic systems.", "title": "Fuzzy Systems", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1.5, 0.5, 0.5, 3, 1.8], "moduleCredit": "4", "moduleCode": "KE4203", "semesterData": []}, "KE4204": {"acadYear": "2019/2020", "description": "The objectives of this course are to introduce students to the concepts, methods and techniques of business analytics. Students will gain the requisite skills to perform analytics in a real life business scenarios through workshops and assignments using tools. Topics included in the course are:\n• Introduction to Business Analytics (NEW);\n• Business Intelligence fundamentals (NEW);\n• Exploratory data analysis and visualization;\n• Segmentation and clustering;\n• Market basket analysis;\n• Advanced modelling using decision trees, rule induction, regression, neural networks;\n• Data mining for CRM and market planning;\n• Data mining tools.\nThis course is highly appropriate for all professional workers who must process and analyze large amounts of data for corporate decision making.", "title": "Business Analytics", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [2, 0.5, 0.5, 3, 2], "moduleCredit": "3", "moduleCode": "KE4204", "semesterData": []}, "KE4205": {"acadYear": "2019/2020", "description": "The objective of this module is to provide an introduction to knowledge management for software/knowledge engineers. It will cover the essential principles and best practices of knowledge management (KM) as they are applied within the software development  industry. (refer to syllabus below for topics covered) There is an assignment\nin which students design and possibly implement a KM system in their workplace. This course is appropriate for software engineers who wish to gain an appreciation of KM\nand how it can be applied to Software Engineering projects,", "title": "Introduction to Knowledge Management", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [2, 0.5, 0.5, 3, 2], "moduleCredit": "3", "moduleCode": "KE4205", "semesterData": []}, "KE5001": {"acadYear": "2019/2020", "description": "KE5001-1 Knowledge Acquisition & Problem Modeling\nThe objectives of this module are to describe the knowledge engineering process. The module will teach identification of knowledge-based application, knowledge elicitation techniques (including interviewing techniques, LaFrance knowledge acquisition grids, concept dictionary, goal reduction trees, etc.), knowledge modeling based on CommonKADS, knowledge-based design and implementation: block diagram, interaction diagram, validation and verification of knowledge-bases. This module is compulsory for all KE students.\n\nKE5001-2 KBS Prototyping Project\nThe objective of this prototyping project is to consolidate the training in Units 1 (KE fundamentals) and Unit 3 (developing knowledge based systems) as well as prepare students for their internship project by giving them the experience in developing a knowledge-based system prototype, from knowledge acquisition (including mock interviews with a domain expert), knowledge modeling, design, implementation and testing.  The prototype system will be developed using an expert system tool introduced in Unit 1, such as Eclipse or CLIPS; and a technical report must be written. This module is compulsory for all KE students.", "title": "Kbs Development", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "moduleCredit": "4", "moduleCode": "KE5001", "semesterData": []}, "KE5002": {"acadYear": "2019/2020", "description": "KE5002-1 Neural Network Computing\nThe objectives of this course are to give an introduction to Neural Networks. Topics covered during the course include Perceptrons; Multi-layer Feed-forward Networks with Back-propagation learning; RBF and GRNN networks; Unsupervised Learning with SOM, Fuzzy systems and Soft Computing, Principal Component Analysis based Hybrid architectures; classification, forecasting and other applications including bioinformatics and financial engineering; There is a Neural network computing assignment. This module is compulsory for all KE students.\n\nKE5002-2 Scheduling & Resource Allocation\nThe objective of this module is to provide the basic understanding for solving scheduling and resource allocation problems with emphasis on the heuristic search techniques. Topics covered include : Introduction to Scheduling; Modeling of Scheduling Problems; Search Techniques; Problem Abstraction Techniques; A Generic Tool for Solving Scheduling Problem - Ilog Schedule; Implementing a Heuristic Search Solution for a Scheduling Problem. This module is compulsory for all KE students.", "title": "Advanced Artificial Intelligence Techniques", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [3, 1, 1, 9.2, 5], "moduleCredit": "4", "moduleCode": "KE5002", "semesterData": []}, "KE5003": {"acadYear": "2019/2020", "description": "KE5003-1 Hybrid Architectures & Soft Computing\nThe objective of this module is to teach the use of Hybrid Architectures and Soft Computing in Knowledge engineering. The module reviews KE techniques and matches these to problem types. Other topics include Review of  Fuzzy, Neural and GA modeling. Building hybrid systems, typical architectures, and integration issue. This module is compulsory for all KE students.\n\nKE5003-2 Hybrid System Workshops\nThe objective of this module is to allow students to use Hybrid KE techniques to carry out a workshop. The module begins by introducing the workshops (which are based on optimization and forecasting), reviewing the available KE software tools and describing the workshop guidelines. After completing the workshop there will be student presentations and assessments. There will be a graded assignment. This module is compulsory for all KE students.", "title": "Hybrid Ke Systems", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [3, 1, 1, 9.2, 5], "moduleCredit": "4", "moduleCode": "KE5003", "semesterData": []}, "KE5004": {"acadYear": "2019/2020", "description": "The objectives of this course are to teach how to understand and use GA techniques. Topics covered in this course include; Introduction to GA theory and operation; GA Case Studies; Problem structuring and modeling for GA solutions; Selection and optimization of control parameters; GA applications and solutions; Currently available GA tools; Comparison of GA with other solution methods; and GA workshops and projects using the Evolver  tool. There is an assignment in developing a GA system. These courses are particularly appropriate for those students who wish to apply sophisticated solutions to difficult problems.", "title": "Genetic Algorithms", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1.5, 0.5, 0.5, 3, 1.8], "moduleCredit": "4", "moduleCode": "KE5004", "semesterData": []}, "KE5005": {"acadYear": "2019/2020", "description": "The course aims to equip students with knowledge and skills to effectively mine large amounts of unstructured textual data to discover themes, patterns, and trends for\nbusiness intelligence, research, or investigation. The students will be introduced to the concepts, techniques, and methods for common text mining tasks, such as data\npre-processing and preparation, linguistic/knowledge resources management, concept extraction, text categorization, clustering, association analysis, and trend detection. The scenario-based case studies will enable the students to understand the application of text mining in business and research context, whereas hands-on workshops will allow them to practice performing the above mining tasks following a text mining process.", "title": "Text Mining", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1.5, 0.5, 0.5, 3, 2], "moduleCredit": "4", "moduleCode": "KE5005", "semesterData": []}, "KE5006": {"acadYear": "2019/2020", "description": "This module aims to impart practical knowledge and experience of research processes, various research methods, literature reviews, results analysis and research paper writing. The course is designed so that objectives are fulfilled gradually in the course of conducting the actual research work and through individual guidance by ISS researchers.\n\nProjects are expected to be complex and challenging, and typically requires innovative problem solving approaches, field experimentation, algorithm design & system development. Students can propose to work on a specific\narea of applied research or to work on an industry sponsored problem. All research activities are supervised by ISS research and teaching staff.", "title": "Applied Research", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [0, 2, 4, 4, 0], "moduleCredit": "4", "moduleCode": "KE5006", "semesterData": [{"semester": 2, "timetable": [{"classNo": "1", "startTime": "0900", "endTime": "1700", "weeks": {"start": "2020-01-11", "end": "2020-01-11"}, "venue": "Innovation", "day": "Saturday", "lessonType": "Lecture", "size": 270}]}]}, "KE5101": {"acadYear": "2019/2020", "description": "KE5101-1 Knowledge Acquisition & Problem Modeling\nThe objectives of this module are to describe the knowledge engineering process. The module will teach identification of knowledge-based application, knowledge elicitation techniques (including interviewing techniques, LaFrance knowledge acquisition grids, concept dictionary, goal reduction trees, etc.), knowledge modeling based on CommonKADS, knowledge-based design and implementation: block diagram, interaction diagram, validation and verification of knowledge-bases. This module is compulsory for all KE students.\n\nKE5101-2 KBS Prototyping Project\nThe objective of this prototyping project is to consolidate the training in Units 1 (KE fundamentals) and Unit 3 (developing knowledge based systems) as well as prepare students for their internship project by giving them the experience in developing a knowledge-based system prototype, from knowledge acquisition (including mock interviews with a domain expert), knowledge modeling, design, implementation and testing.  The prototype system will be developed using an expert system tool introduced in Unit 1, such as Eclipse or CLIPS; and a technical report must be written. This module is compulsory for all KE students.", "title": "Kbs Development", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "moduleCredit": "8", "moduleCode": "KE5101", "semesterData": []}, "KE5102": {"acadYear": "2019/2020", "description": "KE5002-1 Neural Network Computing\nThe objectives of this course are to give an introduction to Neural Networks. Topics covered during the course include Perceptrons; Multi-layer Feed-forward Networks with Back-propagation learning; RBF and GRNN networks; Unsupervised Learning with SOM, Fuzzy systems and Soft Computing, Principal Component Analysis based Hybrid architectures; classification, forecasting and other applications including bioinformatics and financial engineering; There is a Neural network computing assignment. This module is compulsory for all KE students.\n\nKE5002-2 Scheduling & Resource Allocation\nThe objective of this module is to provide the basic understanding for solving scheduling and resource allocation problems with emphasis on the heuristic search techniques. Topics covered include : Introduction to Scheduling; Modeling of Scheduling Problems; Search Techniques; Problem Abstraction Techniques; A Generic Tool for Solving Scheduling Problem - Ilog Schedule; Implementing a Heuristic Search Solution for a Scheduling Problem. This module is compulsory for all KE students.", "title": "Advanced Techniques", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [3, 1, 1, 9.2, 5], "moduleCredit": "8", "moduleCode": "KE5102", "semesterData": []}, "KE5103": {"acadYear": "2019/2020", "description": "KE5103-1 Hybrid Architectures & Soft Computing\nThe objective of this module is to teach the use of Hybrid Architectures and Soft Computing in Knowledge engineering. The module reviews KE techniques and matches these to problem types. Other topics include Review of  Fuzzy, Neural and GA modeling. Building hybrid systems, typical architectures, and integration issue. This module is compulsory for all KE students.\n\nKE5103-2 Hybrid System Workshops\nThe objective of this module is to allow students to use Hybrid KE techniques to carry out a workshop. The module begins by introducing the workshops (which are based on optimization and forecasting), reviewing the available KE software tools and describing the workshop guidelines. After completing the workshop there will be student presentations and assessments. There will be a graded assignment. This module is compulsory for all KE students.", "title": "Hybrid Ke Systems", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [3, 1, 1, 9.2, 5], "moduleCredit": "8", "moduleCode": "KE5103", "semesterData": []}, "KE5105": {"acadYear": "2019/2020", "description": "", "title": "Knowledge Engineering Project", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "moduleCredit": "12", "moduleCode": "KE5105", "semesterData": [{"semester": 1, "timetable": []}, {"semester": 2, "timetable": []}]}, "KE5106": {"acadYear": "2019/2020", "description": "The aim of this second core course - unit 3 of the Master of Technology (MTech) in Knowledge Engineering (KE) - is to present Data Warehousing as an important preparatory process in the development of intelligent systems for Business Analytics. \nThe objectives of the course are to: \n(1) Present the fundamental principles and practices of Data Warehousing. \n(2) Present the Data Warehousing process through the discussion of data modelling, dimension design, domain knowledge acquisition, understanding and modelling \ncustomer requirements, identifying data sources, data extraction, cleansing and transformation, data loading onto the analytical engine, and data preparation and \nexploration.", "title": "Data Warehousing for Business Analytics", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [3, 1, 1, 10, 5], "moduleCredit": "8", "moduleCode": "KE5106", "semesterData": [{"semester": 1, "timetable": [{"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-29", "end": "2019-08-26"}, "venue": "Frontier", "day": "Monday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-16", "end": "2019-07-16"}, "venue": "ISS/AUD", "day": "Tuesday", "lessonType": "Lecture", "size": 50}, {"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-16", "end": "2019-07-16"}, "venue": "ISS/AUD", "day": "Tuesday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-27", "end": "2019-08-24"}, "venue": "Interaction", "day": "Saturday", "lessonType": "Lecture", "size": 50}, {"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-18", "end": "2019-07-18"}, "venue": "ISS/AUD", "day": "Thursday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-17", "end": "2019-07-17"}, "venue": "ISS/AUD", "day": "Wednesday", "lessonType": "Lecture", "size": 50}, {"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-17", "end": "2019-07-17"}, "venue": "ISS/AUD", "day": "Wednesday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-19", "end": "2019-07-19"}, "venue": "ISS/AUD", "day": "Friday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-15", "end": "2019-07-15"}, "venue": "ISS/AUD", "day": "Monday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-18", "end": "2019-07-18"}, "venue": "ISS/AUD", "day": "Thursday", "lessonType": "Lecture", "size": 50}, {"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-15", "end": "2019-07-15"}, "venue": "ISS/AUD", "day": "Monday", "lessonType": "Lecture", "size": 50}, {"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-19", "end": "2019-07-19"}, "venue": "ISS/AUD", "day": "Friday", "lessonType": "Lecture", "size": 50}]}]}, "KE5107": {"acadYear": "2019/2020", "description": "The aim of this third core course - unit 5 of the Master of Technology (MTech) in Knowledge Engineering (KE) - is to present Data Mining as an important knowledge discovery process in the development of intelligent systems for Business Analytics. The objectives of the course are to: \n(1) Provide in-depth coverage the methodology and methods of Data Mining. \n(2) Present Data Mining as the fundamental technique for Knowledge Discovery through the discussion of representative machine learning schemes and algorithms, typical tasks in mining relationships, \nclassification and clustering.", "title": "Data Mining Methodology and Methods", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [3, 1, 1, 10, 5], "moduleCredit": "8", "moduleCode": "KE5107", "semesterData": [{"semester": 2, "timetable": [{"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": [2], "venue": "Interaction", "day": "Monday", "lessonType": "Lecture", "size": 100}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2020-02-15", "end": "2020-03-14"}, "venue": "Integrity", "day": "Saturday", "lessonType": "Lecture", "size": 100}, {"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": [2], "venue": "Interaction", "day": "Tuesday", "lessonType": "Lecture", "size": 100}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": [2], "venue": "Interaction", "day": "Wednesday", "lessonType": "Lecture", "size": 100}, {"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": [2], "venue": "Interaction", "day": "Friday", "lessonType": "Lecture", "size": 100}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": [2], "venue": "Interaction", "day": "Monday", "lessonType": "Lecture", "size": 100}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": [2], "venue": "Interaction", "day": "Tuesday", "lessonType": "Lecture", "size": 100}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": [2], "venue": "Interaction", "day": "Thursday", "lessonType": "Lecture", "size": 100}, {"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": [2], "venue": "Interaction", "day": "Wednesday", "lessonType": "Lecture", "size": 100}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": [2], "venue": "Interaction", "day": "Friday", "lessonType": "Lecture", "size": 100}, {"classNo": "F1", "startTime": "1700", "endTime": "1900", "weeks": [2], "venue": "Interaction", "day": "Thursday", "lessonType": "Lecture", "size": 100}]}], "fulfillRequirements": ["KE5108"]}, "KE5108": {"acadYear": "2019/2020", "description": "The aim of this fourth core course - unit 7 of the Master of Technology (MTech) in Knowledge Engineering (KE) - is to discuss the system engineering (ie: modelling and \ndevelopment) of intelligent systems for Business Analytics. \nThe objectives of the course are to: \n(1) Present the major stages of development cycle, including problem understanding, problem modelling, system architecture and design, algorithm/technique selection and system development and fine-tuning. \n(2) Introduce some of the typical hybrid architectures of intelligent system for problem solving in the Business Analytics context. (3) Discuss some advanced techniques and algorithms \nand their role in Business Analytics.", "title": "Developing Intelligent Systems for Performing Business Analytics", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [3, 1, 1, 10, 5], "prerequisite": "KE4102 Intelligent Systems and Techniques for Business Analytics \nKE5107 Data Mining Methodology and Methods", "moduleCredit": "8", "moduleCode": "KE5108", "semesterData": [{"semester": 1, "timetable": [{"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-24", "end": "2019-07-24"}, "venue": "Frontier", "day": "Wednesday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-25", "end": "2019-07-25"}, "venue": "Frontier", "day": "Thursday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-08-03", "end": "2019-08-31"}, "venue": "Integrity", "day": "Saturday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-23", "end": "2019-07-23"}, "venue": "Frontier", "day": "Tuesday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-22", "end": "2019-07-22"}, "venue": "Frontier", "day": "Monday", "lessonType": "Lecture", "size": 50}, {"classNo": "P1", "startTime": "1700", "endTime": "1900", "weeks": {"start": "2019-07-26", "end": "2019-07-26"}, "venue": "Frontier", "day": "Friday", "lessonType": "Lecture", "size": 50}], "examDate": "2019-11-18T10:30:00.000Z", "examDuration": 210}], "prereqTree": {"or": ["KE4102", "KE5107"]}}, "KE5109": {"acadYear": "2019/2020", "preclusion": "Students that select KE5105 Knowledge Engineering Project cannot also select the Knowledge Engineering Overseas Practicum and vice versa.", "description": "The Knowledge Engineering Overseas Practicum is designed to allow students to experience entrepreneurial enterprises, such as high technology start-up companies, in rapidly developing economies, such as Israel and China, and contribute to those companies by playing a significant role in the development advanced software products or in solving complex business problems.\n\nThe practicum allows students to apply their knowledge in a real world context, demonstrating their mastery of a range of Knowledge Engineering skills, such as problem formulation, problem modeling, knowledge discovery, solution design and construction, verification and validation.\n\nThis module is conducted in collaboration with the NUS Overseas Colleges (NOC).", "title": "Knowledge Engineering Overseas Practicum", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [0, 0, 0, 30, 0], "prerequisite": "Before commencing the Knowledge Engineering Overseas Practicum, the students must successfully complete the four MTech KE core courses:\n\nKE4102 Intelligent Systems and Techniques for Business Analytics\nKE5106 Data Warehousing for Business Analytics\nKE5107 Data Mining Methodology and Methods\nKE5108 Developing Intelligent Systems for Performing Business Analytics\n\nIn addition, they must demonstrate in the electives they have taken and/or in their work experience that they have the technical background for the project being offered by NOC.", "moduleCredit": "12", "moduleCode": "KE5109", "semesterData": [], "prereqTree": "KE4102"}, "KE5204": {"acadYear": "2019/2020", "description": "The objectives of this course are to teach how to understand and use GA techniques. Topics covered in this course include; Introduction to GA theory and operation; GA Case Studies; Problem structuring and modeling for GA solutions; Selection and optimization of control parameters; GA applications and solutions; Currently available GA tools; Comparison of GA with other solution methods; and GA workshops and projects using the Evolver  tool. There is an assignment in developing a GA system. These courses are particularly appropriate for those students who wish to apply sophisticated solutions to difficult problems", "title": "Genetic Algorithms", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1.5, 0.5, 0.5, 3, 1.8], "moduleCredit": "3", "moduleCode": "KE5204", "semesterData": []}, "KE5205": {"acadYear": "2019/2020", "description": "The course aims to equip students with knowledge and skills to effectively mine large amounts of unstructured textual data to discover themes, patterns, and trends for\nbusiness intelligence, research, or investigation. The students will be introduced to the concepts, techniques, and methods for common text mining tasks, such as data\npre-processing and preparation, linguistic/knowledge resources management, concept extraction, text categorization, clustering, association analysis, and trend\ndetection. The scenario-based case studies will enable the students to understand the application of text mining in business and research context, whereas hands-on\nworkshops will allow them to practice performing the above mining tasks following a text mining process.", "title": "Text Mining", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1.5, 0.5, 0.5, 3, 2], "moduleCredit": "3", "moduleCode": "KE5205", "semesterData": [{"semester": 1, "timetable": [{"classNo": "P1", "startTime": "1300", "endTime": "1500", "weeks": {"start": "2019-09-07", "end": "2019-10-05"}, "venue": "Interaction", "day": "Saturday", "lessonType": "Lecture", "size": 130}], "examDate": "2019-11-20T10:30:00.000Z", "examDuration": 210}, {"semester": 2, "timetable": [{"classNo": "P1", "startTime": "0900", "endTime": "1700", "weeks": {"start": "2020-01-08", "end": "2020-01-08"}, "venue": "Innovation", "day": "Wednesday", "lessonType": "Lecture", "size": 130}, {"classNo": "P1", "startTime": "0900", "endTime": "1700", "weeks": {"start": "2020-01-07", "end": "2020-01-07"}, "venue": "Innovation", "day": "Tuesday", "lessonType": "Lecture", "size": 130}, {"classNo": "P1", "startTime": "0900", "endTime": "1700", "weeks": {"start": "2020-01-06", "end": "2020-01-06"}, "venue": "Innovation", "day": "Monday", "lessonType": "Lecture", "size": 130}]}], "fulfillRequirements": ["EB5002"]}, "KE5206": {"acadYear": "2019/2020", "description": "The aim of this elective course of the Master of Technology (MTech) in Knowledge Engineering (KE) is to introduce Neural Networks and Support Vector Machines \nand their role in the development of intelligent systems for Business Analytics The objectives of the course are to: \n(1) Introduce computational intelligence techniques with a focus on Neural Networks and Support Vector Machine. \n(2) Explore how these techniques can be used to construct intelligent systems to solve real-world problems such as classification, clustering and prediction.", "title": "Computational Intelligence I", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1, 0.5, 0.5, 3, 2], "moduleCredit": "3", "moduleCode": "KE5206", "semesterData": [{"semester": 2, "timetable": [{"classNo": "1", "startTime": "0800", "endTime": "1000", "weeks": {"start": "2020-03-28", "end": "2020-04-25"}, "venue": "Integrity", "day": "Saturday", "lessonType": "Lecture", "size": 100}]}]}, "KE5207": {"acadYear": "2019/2020", "description": "The aim of this elective course of the Master of Technology (MTech) in Knowledge Engineering (KE) is to introduce Fuzzy Systems, Rough Sets, Bayesian Nets and \nEvolutionary Computation and their role in the development of intelligent systems for Business Analytics The objectives of the course are to: \n(1) Introduce computational intelligence techniques with a focus on Fuzzy Systems, Rough Sets, Bayesian Nets and Evolutionary Computation. \n(2) Explore how these techniques can be used to construct intelligent systems to solve real-world problems such as reasoning, decision making and optimization.", "title": "Computational Intelligence II", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1, 0.5, 0.5, 3, 2], "moduleCredit": "3", "moduleCode": "KE5207", "semesterData": [{"semester": 1, "timetable": [{"classNo": "1", "startTime": "1300", "endTime": "1500", "weeks": {"start": "2019-09-07", "end": "2019-10-05"}, "venue": "Frontier", "day": "Saturday", "lessonType": "Lecture", "size": 80}], "examDate": "2019-11-21T10:30:00.000Z", "examDuration": 210}]}, "KE5208": {"acadYear": "2019/2020", "description": "Sense-making is the process of creating situational awareness and understanding in situations of high complexity or uncertainty in order to make decisions. Strategic data analytics based solutions can be roughly modelled at three levels: sensing, sense-making and decision making. This module focuses on sense-making which is the ability to describe, diagnose and resolve problem situations in a multi-sensor (up to thousands of sensors) environment. It complements existing MTech KE\ncourses by developing practical know-how in data processing, data analysis, event processing, data visualization and insights discovery techniques.", "title": "Sense Making and Insight Discovery", "department": "Institute of Systems Science", "faculty": "Institute of Systems Science", "workload": [1.5, 0.5, 0.5, 3, 2], "prerequisite": "There are no hard prerequisites in terms of existing courses, but it would be desirable for students to have some interest in data mining.", "moduleCredit": "3", "moduleCode": "KE5208", "semesterData": [{"semester": 1, "timetable": [{"classNo": "P1", "startTime": "1500", "endTime": "1700", "weeks": [8, 9, 10, 11, 12], "venue": "Interaction", "day": "Saturday", "lessonType": "Lecture", "size": 130}], "examDate": "2019-11-23T10:30:00.000Z", "examDuration": 210}, {"semester": 2, "timetable": [{"classNo": "P1", "startTime": "0900", "endTime": "1700", "weeks": {"start": "2020-01-09", "end": "2020-01-09"}, "venue": "Innovation", "day": "Thursday", "lessonType": "Lecture", "size": 25}, {"classNo": "P1", "startTime": "0900", "endTime": "1700", "weeks": [1], "venue": "Innovation", "day": "Tuesday", "lessonType": "Lecture", "size": 25}, {"classNo": "P1", "startTime": "0900", "endTime": "1700", "weeks": [1], "venue": "Innovation", "day": "Monday", "lessonType": "Lecture", "size": 25}, {"classNo": "P1", "startTime": "0900", "endTime": "1700", "weeks": {"start": "2020-01-10", "end": "2020-01-10"}, "venue": "Innovation", "day": "Friday", "lessonType": "Lecture", "size": 25}]}]}}
